fio/bs_su64k_o4m/randr_s2g_j32.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 32 threads
randr: Laying out IO file (1 file / 2048MiB)
randr: Laying out IO file (1 file / 2048MiB)
randr: Laying out IO file (1 file / 2048MiB)
[...]

randr: (groupid=0, jobs=32): err= 0: pid=9507: Wed Feb 19 10:38:19 2020
  read: IOPS=2122, BW=16.6MiB/s (17.4MB/s)(4977MiB/300082msec)
    slat (usec): min=23, max=910, avg=48.87, stdev=11.56
    clat (usec): min=10, max=240348, avg=15020.27, stdev=13894.28
     lat (usec): min=439, max=240399, avg=15069.31, stdev=13894.29
    clat percentiles (usec):
     |  1.00th=[   603],  5.00th=[  4359], 10.00th=[  7111], 20.00th=[  8717],
     | 30.00th=[  9634], 40.00th=[ 10290], 50.00th=[ 11469], 60.00th=[ 13042],
     | 70.00th=[ 14877], 80.00th=[ 17433], 90.00th=[ 23200], 95.00th=[ 33817],
     | 99.00th=[ 87557], 99.50th=[ 93848], 99.90th=[110625], 99.95th=[117965],
     | 99.99th=[145753]
   bw (  KiB/s): min= 8226, max=24672, per=100.00%, avg=17004.79, stdev=84.96, samples=19162
   iops        : min= 1028, max= 3084, avg=2125.57, stdev=10.62, samples=19162
  lat (usec)   : 20=0.01%, 500=0.03%, 750=3.45%, 1000=0.45%
  lat (msec)   : 2=0.28%, 4=0.62%, 10=31.00%, 20=49.84%, 50=10.98%
  lat (msec)   : 100=3.06%, 250=0.27%
  cpu          : usr=0.02%, sys=0.26%, ctx=1174094, majf=0, minf=12756
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=636996,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=16.6MiB/s (17.4MB/s), 16.6MiB/s-16.6MiB/s (17.4MB/s-17.4MB/s), io=4977MiB (5218MB), run=300082-300082msec